//==================================================================================================================
//
// HPクラス[hitpoint.h]
// Author:Seiya Takahashi
//
//==================================================================================================================
#ifndef _HITPOINT_H
#define _HITPOINT_H

//==================================================================================================================
// インクルードファイル
//==================================================================================================================
#include "main.h"
#include "scene.h"

//==================================================================================================================
// 前方宣言
//==================================================================================================================
class CBar;
class CScene;

//==================================================================================================================
//クラスの定義
//==================================================================================================================
class CHitPoint : public CScene
{
public:

	CHitPoint(PRIORITY type);			// コンストラクタ
	~CHitPoint();						// デストラクタ
	void Init(void);					// 初期化処理
	void Uninit(void);					// 終了処理
	void Update(void);					// 更新処理
	void Draw(void);					// 描画処理

	static CHitPoint *Create(void);		// 生成処理

	void SetPos(D3DXVECTOR3 pos);		// 位置設定処理

	D3DXVECTOR3 GetPos(void);			// 位置取得処理

protected:

private:

	CBar *m_pBar;						// バーの情報ポインタ
	D3DXVECTOR3 m_pos;					// 位置
	D3DXVECTOR3 m_rot0;					// 回転
	D3DXVECTOR3 m_rot1;					// 回転
	D3DXVECTOR3 m_rot2;					// 回転
	D3DXVECTOR3 m_rot3;					// 回転

	int m_nCntCol0;						// α値減少用カウンタ
	int m_nCntCol1;						// α値減少用カウンタ
	int m_nCntCol2;						// α値減少用カウンタ
	int m_nCntCol3;						// α値減少用カウンタ

	float m_fNowHP;						// 現在のHP
	float m_fMaxHP;						// 最大HP
	float m_fHeight;					// 縦の長さ

	bool m_bBar[5];						// バーがあるかどうか
};

//==================================================================================================================
//プロトタイプ宣言
//==================================================================================================================

#endif
