//==================================================================================================================
//
// マップ選択画面処理[mapSelect.h]
// Author : Seiya Takahashi
//
//==================================================================================================================
#ifndef _MAPSELECT_H
#define _MAPSELECT_H

//==================================================================================================================
// インクルードファイル
//==================================================================================================================
#include "main.h"

//==================================================================================================================
// 前方宣言
//==================================================================================================================
class CCamera;
class CLight;
class CPolygon;
class CUI;

//==================================================================================================================
//
// マップ選択クラスの定義
//
//==================================================================================================================
class CMapSelect
{
public:
	CMapSelect();								// コンストラクタ
	~CMapSelect();								// デストラクタ
	void Init(void);							// 初期化処理
	void Uninit(void);							// 終了処理
	void Update(void);							// 更新処理
	void Draw(void);							// 描画処理

	static CMapSelect *Create(void);			// 生成処理

protected:

private:
	static LPDIRECT3DTEXTURE9 m_pTexture;		// テクスチャの情報ポインタ
	static CCamera *m_pCamera;					// カメラのの情報ポインタ
	static CLight *m_pLight;					// ライトのの情報ポインタ
	static CPolygon *m_pPolygon;				// ポリゴンの情報ポインタ
	static CUI *m_pUI;							// UIの情報ポインタ

	LPDIRECT3DVERTEXBUFFER9 m_pVertexBuff;		// 頂点バッファ

	bool m_bSelectMap;							// マップが選択されているか

};
#endif
