//*************************************************************************************************************
//
// 反射の処理[Reflection.h]
// Author : Sekine Ikuto
//
//*************************************************************************************************************
#ifndef _REFLECTION_H_
#define _REFLECTION_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "Mylibrary.h"

//-------------------------------------------------------------------------------------------------------------
// クラス定義
//-------------------------------------------------------------------------------------------------------------
class CReflection
{
public:
	// 平面の反射後の位置とベクトルを算出する
	static void GetPlaneReflectingAfterPosAndVec(
		D3DXVECTOR3 *pOutPos,		// 反射後の位置
		D3DXVECTOR3 *pOutMoveVec,	// 反射後の移動ベクトル
		D3DXVECTOR3 *pPos,			// 衝突した時の位置
		D3DXVECTOR3 *pMove,			// 衝突した時の移動量
		D3DXVECTOR3 *pNormal		// 衝突した面の法線ベクトル
	);
private:


};




#endif